src/Catalogs/кфкСпецификации/кфкСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкСпецификации</name>
  <owners>Catalog.кфкПриложенияСпецификаций</owners>
  <attributes>
    <name>АдресТопика</name>
    <comment>channels.{ИмяКанала}.address: {АдресТопика}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКанала</name>
    <comment>channels.{ИмяКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперации</name>
    <comment>operations.{ИмяОперации}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщения</name>
    <comment>components.messages.{ИмяСообщения}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщенияКанала</name>
    <comment>channels.{ИмяКанала}.messages.{ИмяСообщенияКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСхемы</name>
    <comment>components.schemas.{ИмяСхемы}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/кфкСпецификации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = "АдресТопика,ИмяКанала,ИмяОперации,ИмяСообщения,ИмяСообщенияКанала,ИмяСхемы";
	Для Каждого ИмяРеквизита Из СтрРазделить(Реквизиты, ",") Цикл
		ЭтотОбъект[ИмяРеквизита] = СокрЛП(ЭтотОбъект[ИмяРеквизита]);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
